Tekla.Structures.Drawing.Automation.AutoDrawingsStatusEnum
The status of the AutoDrawing script execution.

Tekla.Structures.Drawing.Automation.AutoDrawingsStatusEnum.OPERATION_OK
The AutoDrawing script was executed without errors.

Tekla.Structures.Drawing.Automation.AutoDrawingsStatusEnum.OPERATION_FAILED
An error occured during the AutoDrawing script execution. See the AutoDrawing log file for more details.

Tekla.Structures.Drawing.Automation.AutoDrawingsStatusEnum.ERROR_NUMBERING_NOT_UPTODATE
The AutoDrawing script could not be executed because the numbering was not up-to-date.

Tekla.Structures.Drawing.Automation.AutoDrawingsStatusEnum.ERROR_DRAWING_EDITOR_MUST_BE_CLOSED
The command could not be executed because a drawing was open. Close the drawing and try again.